Yes, you can see it there:

```
➜  ~/exo/terraform-test terraform apply                                                                                                                                                                                                                                                                     25-06-17 13:19 
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - exoscale/exoscale in /home/tgrondier/exo/terraform-provider-exoscale
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.exoscale_template.my_template: Reading...
data.exoscale_template.my_template: Read complete after 0s [id=1afba856-c1c0-40b9-8165-2b9162a0c4c2]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # exoscale_block_storage_volume.test will be created
  + resource "exoscale_block_storage_volume" "test" {
      + blocksize  = (known after apply)
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "test"
      + state      = (known after apply)
      + zone       = "ch-gva-2"
    }

  # exoscale_compute_instance.my_instance will be created
  + resource "exoscale_compute_instance" "my_instance" {
      + block_storage_volume_ids = (known after apply)
      + created_at               = (known after apply)
      + disk_size                = 10
      + id                       = (known after apply)
      + ipv6                     = false
      + ipv6_address             = (known after apply)
      + mac_address              = (known after apply)
      + name                     = "my-instance"
      + private                  = false
      + private_network_ids      = (known after apply)
      + public_ip_address        = (known after apply)
      + state                    = (known after apply)
      + template_id              = "1afba856-c1c0-40b9-8165-2b9162a0c4c2"
      + type                     = "standard.micro"
      + zone                     = "ch-gva-2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

exoscale_block_storage_volume.test: Creating...
exoscale_block_storage_volume.test: Creation complete after 3s [id=206f4d70-f0f4-491a-9e4b-0d2d6aad465c]
exoscale_compute_instance.my_instance: Creating...
exoscale_compute_instance.my_instance: Still creating... [00m10s elapsed]
╷
│ Error: unable to parse attached instance ID: AttachBlockStorageVolumeToInstance: http response: Conflict: Request restricted: Instance size must be at least small
│ 
│   with exoscale_compute_instance.my_instance,
│   on main.tf line 25, in resource "exoscale_compute_instance" "my_instance":
│   25: resource "exoscale_compute_instance" "my_instance" {
│ 
╵
➜  ~/exo/terraform-test terraform plan                                                                                                                                                                                                                                                                      25-06-17 13:19 
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - exoscale/exoscale in /home/tgrondier/exo/terraform-provider-exoscale
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.exoscale_template.my_template: Reading...
exoscale_block_storage_volume.test: Refreshing state... [id=206f4d70-f0f4-491a-9e4b-0d2d6aad465c]
data.exoscale_template.my_template: Read complete after 0s [id=1afba856-c1c0-40b9-8165-2b9162a0c4c2]
exoscale_compute_instance.my_instance: Refreshing state... [id=7515a8fe-7eee-482d-84ea-d0b188ce5103]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # exoscale_compute_instance.my_instance is tainted, so must be replaced
-/+ resource "exoscale_compute_instance" "my_instance" {
      ~ created_at               = "2025-06-17 11:19:29 +0000 UTC" -> (known after apply)
      ~ id                       = "7515a8fe-7eee-482d-84ea-d0b188ce5103" -> (known after apply)
      + ipv6_address             = (known after apply)
      - labels                   = {} -> null
      ~ mac_address              = "06:75:22:00:1d:2e" -> (known after apply)
        name                     = "my-instance"
      ~ private_network_ids      = [] -> (known after apply)
      ~ public_ip_address        = "92.39.63.40" -> (known after apply)
      - security_group_ids       = [
          - "c0b3333f-b80c-4782-8757-9a5ac3afd2b9",
        ] -> null
      - ssh_keys                 = [] -> null
      ~ state                    = "running" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

if it fails the resource will be replaced on recreation and is added correctly to the state